# pivot_table 실습하기

### 문제 1

다음과 같은 데이터 프레임을 생성한다.
```
df = pd.DataFrame({'Name':['Mary', 'Jon','Lucy', 'Jane', 'Sue', 'Mary', 'Lucy'],
    'Age':[35, 37, 40, 29, 31, 26, 28],
    'City':['Boston', 'Chicago', 'Los Angeles', 'Chicago', 'Boston', 'Boston', 'Chicago'],
    'Position':['Manager','Manager','Manager','Programmer', 'Programmer','Manager','Manager'],
    'Sex':['Female','Male','Female','Female', 'Female','Female','Female']},
     columns=['Name','Position','City','Age','Sex'])

```

In [5]:
import pandas as pd
import numpy as np

In [6]:
df = pd.DataFrame({'Name':['Mary', 'Jon','Lucy', 'Jane', 'Sue', 'Mary', 'Lucy'],
    'Age':[35, 37, 40, 29, 31, 26, 28],
    'City':['Boston', 'Chicago', 'Los Angeles', 'Chicago', 'Boston', 'Boston', 'Chicago'],
    'Position':['Manager','Manager','Manager','Programmer', 'Programmer','Manager','Manager'],
    'Sex':['Female','Male','Female','Female', 'Female','Female','Female']},
     columns=['Name','Position','City','Age','Sex'])

df

   Name    Position         City  Age     Sex
0  Mary     Manager       Boston   35  Female
1   Jon     Manager      Chicago   37    Male
2  Lucy     Manager  Los Angeles   40  Female
3  Jane  Programmer      Chicago   29  Female
4   Sue  Programmer       Boston   31  Female
5  Mary     Manager       Boston   26  Female
6  Lucy     Manager      Chicago   28  Female

### 문제 2
해당 데이터셋을 'Position'별, 'City'별 'Age'의 평균을 집계하시오. pivot_table 기능을 활용하시오.

In [7]:
df.pivot_table(index='Position', columns='City', values='Age')

City        Boston  Chicago  Los Angeles
Position
Manager       30.5     32.5         40.0
Programmer    31.0     29.0          NaN

### 문제 3
해당 데이터셋을 'Position'별, 'City'별 'Age'의 합계를 집계하시오. 'aggfunc'옵션을 사용하시오.

In [8]:
df.pivot_table(index='Position', columns='City', values='Age', aggfunc=sum)

City        Boston  Chicago  Los Angeles
Position
Manager       61.0     65.0         40.0
Programmer    31.0     29.0          NaN

### 문제4
pivot_table을 사용하여 집계하시오. 'Position'을 index에, 'City','Sex'에 columns로 하여 'Age'에 대한 평균을 집계하시오.

In [9]:
df.pivot_table(index='Position', columns=['City','Sex'], values='Age')

City       Boston Chicago       Los Angeles
Sex        Female  Female  Male      Female
Position
Manager      30.5    28.0  37.0        40.0
Programmer   31.0    29.0   NaN         NaN

### 문제 5
단일 피벗 테이블을 사용하여 여러 집계함수를 적용하시오. 'Position'별로 'Age'의 평균과 표준 편차를 구하시오.

In [13]:
df.pivot_table(index='Position', values='Age', aggfunc=['mean','std'])

            mean       std
             Age       Age
Position
Manager     33.2  5.974948
Programmer  30.0  1.414214